v2206/validatioin_CHAD/cavity_piso/0.orig/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 1e-20;

boundaryField
{
    movingWall
    {
        type            fixedValue;
        value           uniform 1e-6;
    }

    fixedWalls
    {
        type            fixedValue;
        value           uniform 1e-20;
    }

    frontAndBack
    {
        type            empty;
    }
}

// dimensions      [0 2 -2 0 0 0 0];

// internalField   uniform 0;

// boundaryField
// {
//     inlet
//     {
//         type            fixedValue;
//         value           uniform 2e-05;
//     }

//     outlet
//     {
//         type            inletOutlet;
//         inletValue      uniform 0;
//         value           uniform 0;
//     }

//     upperWall
//     {
//         type            fixedValue;
//         value           uniform 0;
//     }

//     lowerWall
//     {
//         type            fixedValue;
//         value           uniform 0;
//     }

//     frontAndBack
//     {
//         type            empty;
//     }
// }


// ************************************************************************* //
